main=\u0413\u043b\u0430\u0432\u043d\u0430\u044f
wav_file=wav \u0444\u0430\u0439\u043b
min_idx=\u043c\u0438\u043d. Idx
min_rpm=\u043c\u0438\u043d. RPM
max_idx=\u043c\u0430\u043a\u0441. Idx
max_rpm=\u043c\u0430\u043a\u0441. RPM
generate_gin=\u0421\u043e\u0437\u0434\u0430\u0442\u044c GIN
optional=\u0414\u043e\u043f\u043e\u043b\u043d\u0438\u0442\u0435\u043b\u044c\u043d\u043e
custom_grain_path=\u0412\u044b\u0431\u0440\u0430\u0442\u044c \u043f\u0430\u043f\u043a\u0443 \u0433\u0440\u0430\u043d\u0443\u043b
custom_export_path=\u0421\u043e\u0445\u0440\u0430\u043d\u0438\u0442\u044c \u0432
carbon_name_pattern=\u0428\u0430\u0431\u043b\u043e\u043d NFS Carbon
deceleration=\u0417\u0430\u043c\u0435\u0434\u043b\u0435\u043d\u0438\u0435
language=\u042f\u0437\u044b\u043a
launch_tmxtool=\u0417\u0430\u043f. TMXTool
by=The_Unpunished
confirmation=\u041f\u043e\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043d\u0438\u0435
error=\u041e\u0448\u0438\u0431\u043a\u0430
information=\u0418\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f
success=\u0412\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u043e
couldnt_read_ini=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: GINTool \u043d\u0435 \u0441\u043c\u043e\u0433\u043b\u0430 \u043f\u0440\u043e\u0447\u0438\u0442\u0430\u0442\u044c .ini \u0444\u0430\u0439\u043b
couldnt_write_ini=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: GINTool \u043d\u0435 \u0441\u043c\u043e\u0433\u043b\u0430 \u0437\u0430\u043f\u0438\u0441\u0430\u0442\u044c \u0432 .ini \u0444\u0430\u0439\u043b
restart_now=\u041f\u0435\u0440\u0435\u0437\u0430\u043f\u0443\u0441\u0442\u0438\u0442\u044c \u0441\u0435\u0439\u0447\u0430\u0441?
waveform=\u0410\u0443\u0434\u0438\u043e\u0444\u0430\u0439\u043b Waveform
ginfile=\u0410\u0443\u0434\u0438\u043e\u0444\u0430\u0439\u043b Ginsu2
no_fields_empty=\u0413\u043b\u0430\u0432\u043d\u044b\u0435 \u043f\u043e\u043b\u044f \u0434\u043e\u043b\u0436\u043d\u044b \u0431\u044b\u0442\u044c \u0437\u0430\u043f\u043e\u043b\u043d\u0435\u043d\u044b
no_optional_fields_empty=\u0412\u0441\u0435 \u043f\u043e\u043b\u044f, \u043f\u043e\u043c\u0435\u0447\u0435\u043d\u043d\u044b\u0435 \u0433\u0430\u043b\u043e\u0447\u043a\u043e\u0439, \u0434\u043e\u043b\u0436\u043d\u044b \u0431\u044b\u0442\u044c \u0437\u0430\u043f\u043e\u043b\u043d\u0435\u043d\u044b
tmxtool_not_found=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: tmxtool.jar or launchTMX.bat \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044e\u0442, \u0438\u043b\u0438 \u043f\u0440\u043e\u0446\u0435\u0441\u0441 \u043d\u0435 \u0437\u0430\u043f\u0443\u0441\u0442\u0438\u043b\u0441\u044f \u043f\u043e \u0434\u0440\u0443\u0433\u043e\u0439 \u043f\u0440\u0438\u0447\u0438\u043d\u0435
tmxtool_warning=\u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044c, \u0447\u0442\u043e launchTMX.bat \u0438 tmxtool.jar \u043d\u0430\u0445\u043e\u0434\u044f\u0442\u0441\u044f \u0432 \u0442\u043e\u0439 \u0436\u0435 \u043f\u0430\u043f\u043a\u0435, \u0447\u0442\u043e GINTool. \u041d\u0430\u0436\u043c\u0438\u0442\u0435 \u043d\u0430 \u043a\u043d\u043e\u043f\u043a\u0443 \u0437\u0430\u043f\u0443\u0441\u043a\u0430 \u0441\u043d\u043e\u0432\u0430, \u0447\u0442\u043e\u0431\u044b \u0437\u0430\u043f\u0443\u0441\u0442\u0438\u0442\u044c TMXTool
gin_encoded=GIN \u0441\u043e\u0437\u0434\u0430\u043d
grains_not_found=\u0413\u0440\u0430\u043d\u0443\u043b\u044b \u043d\u0435 \u043d\u0430\u0439\u0434\u0435\u043d\u044b
failed_create_gin_dir=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: GINTool \u043d\u0435 \u0441\u043c\u043e\u0433\u043b\u0430 \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044e \u0434\u043b\u044f .gin \u0444\u0430\u0439\u043b\u043e\u0432. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044c, \u0447\u0442\u043e \u0443 GINTool \u0435\u0441\u0442\u044c \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u0438\u044f \u0438\u043b\u0438 \u043f\u0435\u0440\u0435\u043c\u0435\u0441\u0442\u0438\u0442\u0435 GINTool \u0432 \u0434\u0440\u0443\u0433\u0443\u044e \u043f\u0430\u043f\u043a\u0443
failed_encode_gins=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0438\u043c \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u043e\u043c: \u043e\u043d\u0430 \u0438\u043b\u0438 \u0431\u043e\u043b\u0435\u0435 \u0433\u0440\u0430\u043d\u0443\u043b\u0430 \u043d\u0435 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0430\u043d\u0430. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044c, \u0447\u0442\u043e gin_encode \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0430 \u0438 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044f \u0432\u0430\u0448\u0435\u0439 \u0441\u0438\u0441\u0442\u0435\u043c\u043e\u0439
encoding_grains=\u0418\u0434\u0451\u0442 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0430 \u0433\u0440\u0430\u043d\u0443\u043b...
compiling_table=\u0418\u0434\u0451\u0442 \u0441\u0431\u043e\u0440 \u0442\u0430\u0431\u043b\u0438\u0446\u044b...
couldnt_read_grains=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: GINTool \u043d\u0435 \u0441\u043c\u043e\u0433\u043b\u0430 \u043f\u0440\u043e\u0447\u0438\u0442\u044c \u043e\u0434\u043d\u0443 \u0438\u043b\u0438 \u0431\u043e\u043b\u0435\u0435 \u0433\u0440\u0430\u043d\u0443\u043b
couldnt_write_table=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: GINTool \u043d\u0435 \u0441\u043c\u043e\u0433\u043b\u0430 \u0437\u0430\u043f\u0438\u0441\u0430\u0442\u044c \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0443 GIN
compiling_wav_gin=\u0421\u043e\u0437\u0434\u0430\u043d\u0438\u0435 WAV \u0438 GIN...
failed_to_delete_cut_wav_gin=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: GINTool \u043d\u0435 \u0441\u043c\u043e\u0433\u043b\u0430 \u0443\u0434\u0430\u043b\u0438\u0442\u044c _cut \u0444\u0430\u0439\u043b\u044b \u043f\u0435\u0440\u0435\u0434 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0435\u043c \u043d\u043e\u0432\u044b\u0445
ffmpeg_error=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0438\u043c \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u043e\u043c: \u0443\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044c, \u0447\u0442\u043e FFMPEG \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d \u0438 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044f \u0432\u0430\u0448\u0435\u0439 \u0441\u0438\u0441\u0442\u0435\u043c\u043e\u0439
gin_encode_error=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0438\u043c \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u043e\u043c: \u0443\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044c, \u0447\u0442\u043e gin_encode \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d \u0438 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044f \u0432\u0430\u0448\u0435\u0439 \u0441\u0438\u0441\u0442\u0435\u043c\u043e\u0439
failed_to_delete_cut_wav=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: GINTool \u043d\u0435 \u0441\u043c\u043e\u0433\u043b\u0430 \u0443\u0434\u0430\u043b\u0438\u0442\u044c _cut.wav \u0444\u0430\u0439\u043b \u043f\u043e\u0441\u043b\u0435 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u0432\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0433\u043e GIN
inserting_table=\u0417\u0430\u043c\u0435\u043d\u0430 \u0442\u0430\u0431\u043b\u0438\u0446\u044b...
negative_size_array=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: \u043d\u0430\u0439\u0434\u0435\u043d \u043c\u0430\u0441\u0441\u0438\u0432 \u0441 \u043d\u0435\u0433\u0430\u0442\u0438\u0432\u043d\u044b\u043c \u0440\u0430\u0437\u043c\u0435\u0440\u043e\u043c
table_operations_error=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: GINTool \u043d\u0435 \u0441\u043c\u043e\u0433\u043b\u0430 \u043f\u0440\u043e\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u043d\u0443\u0436\u043d\u044b\u0435 \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0438 \u0441 \u0442\u0430\u0431\u043b\u0438\u0446\u0435\u0439
move_final_gin_error=\u041e\u0448\u0438\u0431\u043a\u0430 \u0441 \u0444\u0430\u0439\u043b\u043e\u043c: GINTool \u043d\u0435 \u0441\u043c\u043e\u0433\u043b\u0430 \u043f\u0435\u0440\u0435\u043c\u0435\u0441\u0442\u0438 \u0444\u0430\u0439\u043b \u0432 \u043a\u043e\u043d\u0435\u0447\u043d\u043e\u0435 \u043c\u0435\u0441\u0442\u043e\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435